In [3]:
#Exercise 1:
fruits={'apples':{'cost':3, 'units':100},
       'bananas':{'cost':1,'units':80},
       'grapes':{'cost':5, 'units':500}}
print(fruits['bananas']['cost'])

1

In [6]:
#Exercise 2:
import pandas as pd
mob=pd.DataFrame({'Device':['MOBILE','DESKTOP'],'active':['yes','no'],'login_id':[12347,11021]})
mob.index=['a','b']
mob

    Device active  login_id
a   MOBILE    yes     12347
b  DESKTOP     no     11021

In [11]:
mob['New_col']=mob['Device'].apply(str.capitalize)
mob

    Device active  login_id  New_col
a   MOBILE    yes     12347   Mobile
b  DESKTOP     no     11021  Desktop

In [21]:
#Exercise 3:
escape_velocity={
'earth':1,
'jupiter':5.32,
'saturn':3.17    
}
del(escape_velocity['jupiter'])
escape_velocity

{'earth': 1, 'saturn': 3.17}

In [26]:
#Exercise 4:
venue=pd.DataFrame({'year':[1998,2002,2006,2010,2014],'host':['France','S.Korea','Germany','S.Africa','Brazil'],'winner':['France','Brazil','Italy','Spain','Germany']})
venue

   year      host   winner
0  1998    France   France
1  2002   S.Korea   Brazil
2  2006   Germany    Italy
3  2010  S.Africa    Spain
4  2014    Brazil  Germany

In [41]:
venue.loc[:,['year','host']]

   year      host
0  1998    France
1  2002   S.Korea
2  2006   Germany
3  2010  S.Africa
4  2014    Brazil

In [45]:
#Exercise 4:
stocks={'Apple':'APPL','Amazon':'AMZN'}
for p,b in stocks.items():
    print(b + ' is ' +p)

APPL is Apple
AMZN is Amazon